Proshares
Ultra
Bloomberg
Crude
NYSEUCO
Class
Period
March
2020
April
2020
filed
complaint
alleges
defendants
made
materially
false
andor
misleading
statements
andor
failed
disclose
decreased
demand
coronavirus
pandemic
increased
supply
diminished
prices
caused
RussiaSaudi
price
caused
extraordinary
market
volatility
massive
influx
investor
capital
Fund
totaling
hundreds
millions
dollars
matter
days
increased
Fund
inefficiencies
heightened
illiquidity
West
Texas
Intermediate
futures
contract
markets
Fund
invested
caused
Fund
approach
positional
regulatory
limits
adverse
trends
exacerbated
Offering
sharp
divergence
spot
future
prices
markets
leading
super
contango
market
dynamic
storage
space
Cushing
Oklahoma
dwindled
insufficient
account
excess
supply
expected
delivered
pursuant
2020
futures
contract
result
could
continue
pursue
passive
investment
strategy
represented
Registration
Statement
causing
results
significantly
deviate
purported
benchmark
NanoX
Imaging
NASDAQNNOX
Class
Period
August
2020
September
2020
filed
complaint
alleges
defendants
made
materially
false
andor
misleading
statements
andor
failed
disclose
NanoXs
commercial
agreements
customers
fabricated
NanoXs
statements
regarding
novel
Nanox
System
misleading
Company
never
provided
data
comparing
images
images
competitors
machines
NanoXs
submission
Food
Drug
Administration
admitted
Nanox
System
original
result
Defendants
public
statements
materially
false
andor
misleading
relevant
times
Nikola
Corporation
VectoIQ
Acquisition
Corp
NASDAQNKLA
Class
Period
March
2020
September
2020
filed
complaint
alleges
defendants
made
materially
false
andor
misleading
statements
andor
failed
disclose
VectoIQ
engage
proper
diligence
regarding
merger
Nikola
Nikola
overstated
inhouse
design
manufacturing
testing
capabilities
Nikola
overstated
hydrogen
production
capabilities
result
Nikola
overstated
ability
lower
cost
hydrogen
fuel
Nikola
founder
Executive
Chairman
Trevor
Milton
tweeted
misleading
test
video
Companys
Nikola
truck
work
experience
background
Nikola
employees
including
Milton
overstated
obfuscated
Nikola
five
trucks
completed
result
defendants
public
statements
materially
false
andor
misleading
relevant
times
Jakubowitz
vigorous
pursuit
justice
shareholders
victim
securities
fraud
Attorney
advertising
Prior
results
guarantee
similar
outcomes
past
couple
weeks
roller
coaster
ride
Nikola
NKLA
Shares
electric
truck
maker
plummeted
following
damning
report
accusing
company’s
founder
Trevor
Milton
making
fraudulent
claims
duping
investors
Shares
took
another
dive
Milton
subsequently
resigned
company
leaving
questions
whether
Nikola
future
without
notorious
ringleader
helm
comeback
cards
Last
week
stock
clawed
back
hefty
amount
loss
gaining
three
consecutive
sessionsA
business
update
management
company
reiterated
plan
become
leader
zeroemissions
transportation
appears
soothed
investors’
jittery
nervesNikola
anticipates
completing
five
prototype
Nikola
trucks
IVECO
facility
following
weeks
expects
road
test
Germany
year
begin
production
shipments
planned
late
2021Additionally
assuaging
investors’
biggest
fears
company’s
planned
partnership
General
Motors
still
appears
trackWhile
Nikolas
partnership
model
subject
criticism
lately
Morgan
analyst
Paul
Coster
calls
compelling
strategy”However
Coster
also
points
Nikola’s
nearterm
success
hinges
signing
dotted
line“We
think
partnership
deal
important
nearterm
catalyst”
Coster
said
“Failure
consummate
deal
would
fatal
blow
Badger
initiative
serious
blow
important
Truck
initiative
view
fuel
station
partnership
announcement
less
important
view
though
potential
validation
company
could
resonate
investors
Pending
completion
five
Nikola
trucks
could
boost
credibility
obviously
partnership
stresstest
company”Coster
remains
positive
Nikola
keeps
Overweight
rating
along
bullish
price
target
analyst
therefore
expects
shares
nearly
current
levels
watch
Coster’s
track
record
click
hereNikola
appears
subject
much
head
scratching
Wall
Street
hand
based
Buys
Holds
Sell
stock
Hold
consensus
rating
Conversely
average
price
target
suggests
potential
upside
year
ahead
NKLA
stock
analysis
TipRanksTo
find
good
ideas
stocks
trading
attractive
valuations
visit
TipRanks’
Best
Stocks
newly
launched
tool
unites
TipRanks’
equity
insightsDisclaimer
opinions
expressed
article
solely
featured
analysts
content
intended
used
informational
purposes
important
analysis
making
investment
Bloomberg
Elusive
cybersecurity
pioneer
John
McAfee
arrested
Spain
evasion
Justice
Department
Washington
saidMcAfee
accused
failing
file
returns
2014
2018
hiding
assets
including
real
estate
vehicle
yacht
name
others
prosecutors
said
indictment
returned
June
unsealed
Tuesday
taken
custody
He’s
held
pending
extradition
Justice
Department
saidProsecutors
claim
McAfee
earned
millions
dollars
promotion
cryptocurrencies
speaking
engagements
consulting
jobs
sale
rights
life
story
documentary
never
filed
returns
Instead
income
paid
accounts
held
names
others
prosecutors
claim
faces
long
five
years
prison
convicted
evasion
year
found
guilty
failing
file
taxesIt’s
latest
legal
complication
eccentric
software
mogul
person
interest
murder
Belize
though
charged
crime
last
year
detained
Dominican
Republic
entering
country
cache
firearms
ammunition
also
briefly
candidate
president
year’s
election
ending
abroad
MarchThe
criminal
charges
announced
hours
Securities
Exchange
Commission
sued
McAfee
promoting
sale
cryptocurrencies
without
disclosing
paid
soThe
commission
claims
McAfee
recommended
least
seven
initial
coin
offerings
Twitter
followers
least
November
2017
February
2018
without
revealing
earned
million
boost
He’s
also
accused
denying
paid
asked
investorsRead
McAfee
fleeing
BelizeThe
seeking
force
McAfee
disgorge
illgotten
gains
prohibit
taking
part
issuance
purchase
sale
digital
asset
securities
unspecified
monetary
penaltiesMcAfee
didn’t
immediately
respond
request
commentThe
commission
also
accused
McAfee
claiming
investor
technical
advisor
“creating
impression
vetted
companies
benefiting
technical
expertise
willing
invest
ventures”When
blogger
exposed
paid
McAfee
still
holding
“virtually
worthless”
securities
offerings
promoted
encouraged
investors
without
revealing
securities
paid
third
party
recommend
according
complaintMcAfee
also
engaged
practice
called
scalping
accumulated
large
amounts
digital
securities
promoted
Twitter
without
disclosing
intention
sell
saidMcAfee
founded
epynonymous
software
firm
1987
Intel
Corp
seeking
build
security
features
directly
chips
bought
company
billion
2010
Thoma
Bravo
taking
stakes
later
2016
Intel
announced
signed
deal
transfer
stake
business
billion
company
filed
public
last
monthFor
articles
like
please
visit
bloombergcomSubscribe
stay
ahead
trusted
business
news
source©2020
Bloomberg
stock
market
rebounded
President
Trump
leaves
Walter
Reed
hospital
Nvidia
leads
chip
stocks
zones
Bloomberg
With
Biden’s
lead
widening
polls
President
Donald
Trump’s
campaign
sidelined
virus
investment
strategists
there’s
less
chance
contested
electionA
clearcut
Democrat
victory
could
avoid
long
messy
legal
battle
provide
certainty
markets
nervous
election
risks
according
strategists
Citigroup
JPMorgan
Chase
CoThe
York
havens
including
bonds
seeing
little
demand
greenback
down“Polls
shifting
close
election
prolonged
uncertainty
dominant
Biden
clean
succession”
said
Peter
Rosenstreich
head
market
strategy
Swissquote
Bank
“That
reducing
uncertainty
increasing
risk
appetite”JPMorgan
Says
Biden
Victory
Could
Mark
Shift
Stock
MarketCrossasset
traders
taking
newsflow
stride
despite
confusion
president’s
condition
positive
tests
Republican
leadersA
poll
released
Sunday
taken
Tuesday’s
debate
Friday’s
news
president’s
infection
found
Biden’s
national
lead
leaped
points
debate
Biden
also
records
monthly
fundraising
August
September
giving
enough
money
dominate
Trump
airwaves“Markets
seem
lowered
chance
prolonged
uncertainty
postNovember
Barclays
strategists
Ajay
Rajadhyaksha
Shawn
Golhar
wrote
note
Sunday
“Given
Vice
President
Biden
ahead
polls
suggests
markets
assigning
probability
less
close
contested
outcome”Barclays
strategists
point
currency
pair
like
Aussie
dollar
versus
proxy
risk
appetite
onemonth
implied
volatility
dropped
lowest
weeks
presidential
debate
since
rebounded
remains
200day
averageThe
bank’s
dollarneutral
Biden
currency
basket
also
risen
recent
days
sign
rising
confidence
former
vicepresident’s
prospectsThe
race
still
closer
states
needed
presidency
unprecedented
number
mailin
ballots
cast
year
pandemic
means
likely
won’t
possible
battleground
states
declare
unofficial
winner
election
night
Election
officials
could
take
days
even
weeks
cases
complete
count
final
determination
could
also
delayed
postelection
lawsuits
challenging
resultsStill
volatility
markets
pricing
risks
election
months
raising
news
tradingWhen
comes
futures
tied
Chicago
Board
Options
Exchange
Volatility
Index
contracts
coming
three
months
trading
expiring
January
signaling
investors
expecting
wilder
equity
swings
around
electionBut
weekend
confusion
Trump’s
state
health
deepened
anxieties
October’s
contracts
cover
polling
date
Monday
jumping
nearly
FridayOn
betting
market
PredictIt
chance
Biden
stands
tiny
drop
peak
Trump’s
positive
test
announced
longshort
strategy
betting
Biden’s
triumph
compiled
Nomura
Holdings
Wolfe
Research
hardly
moved
since
reaching
record
high
ThursdayTreasuries
fell
Monday
yields
longmaturity
bonds
rising
short
difference
five
30year
rates
increased
almost
basis
points
widest
month
investors
pared
holdings
havensThat
confidence
combined
continued
economic
recovery
help
support
equity
markets
potentially
even
rotation
riskier
shares
according
Evercore
ISI“Passage
fiscal
package
plus
Democratic
sweep
would
significant
support
value
cyclicals
near
term”
strategists
Dennis
Debusschere
wrote
note
SundayIf
Trump’s
condition
deteriorates
investors
might
start
wonder
election
could
postponed
would
presidency
place
judging
financial
markets’
reaction
remains
traders’
radar“Our
baseline
risksupportive
macro
outlook
despite
election
uncertainty
change
unless
president’s
health
unexpectedly
takes
worse
turn”
Barclays
strategists
wroteAt
time
still
shortage
debate
whether
Democratic
Republican
policies
would
better
investors
While
pundits
former
would
raise
taxes
tighten
regulations
blow
corporate
profits
others
point
Democratic
sweep
could
boost
government
consumer
spending
fresh
risk
cycleAll
told
disruption
wrought
pandemic
volatile
sitting
president
humdrum
transfer
power
seen
providing
investor
solace“We
sympathy
idea
clean
election
outcome
likely
positive
event
given
“chaos”
risk
overhanging
markets”
strategists
Jefferies
wrote
noteUpdates
market
moves
throughout
adds
quote
fourth
additional
election
contextFor
articles
like
please
visit
bloombergcomSubscribe
stay
ahead
trusted
business
news
source©2020
Bloomberg
‘There
huge
husband
education
uninterrupted
work
history
continued
climb
corporate
ladder’
Bloomberg
Companies
selling
risky
loans
fund
payouts
fastest
pace
years
Harbor
Freight
Tools
discount
tools
retailer
billionaire
Eric
Smidt
latest
borrower
looking
line
pocketsThe
company
sells
wrenches
plier
sets
seeking
borrow
billion
fifth
deal
past
decade
according
data
compiled
BloombergIt
plans
proceeds
refinance
existing
debt
rest
dividend
according
person
familiar
matter
Credit
Suisse
Group
leading
sevenyear
deal
kicked
marketing
Monday
offering
price
soon
said
person
asking
identified
discussing
private
matterRepresentatives
Camarillo
Californiabased
company
didn’t
immediately
respond
request
comment
representative
Credit
Suisse
declined
commentSocalled
dividend
recapitalizations
soared
recent
weeks
amid
borrowing
costs
fueled
part
liquidityboosting
policies
Federal
Reserve
rising
demand
yieldstarved
investors
little
else
About
billion
loans
funding
payouts
shareholders
launched
September
month
years
data
compiled
Bloomberg
showRead
Private
equity
using
loans
payouts
fastest
pace
yearsSmidt
Harbor
Freight’s
chairman
chief
executive
officer
steadily
raising
debt
closely
held
company
since
2005
dividend
deals
issued
2010
2012
2013
2016
according
Bloombergcompiled
data
Smidt’s
worth
billion
according
Bloomberg
Billionaires
IndexHarbor
Freight
offering
investors
spread
percentage
points
London
interbank
offered
rate
loan
according
person
Like
recent
deals
kind
debt
rated
tier
junk
debt
Moody’s
Investors
Service
three
levels
investment
gradeIts
business
also
fared
relatively
well
pandemic
stores
deemed
essential
vast
majority
premises
remaining
open
modified
hours
outbreak
according
Moody’s
dividend
deal
million
additional
debt
company’s
balance
sheet
could
deleverage
quickly
according
Moody’sFor
articles
like
please
visit
bloombergcomSubscribe
stay
ahead
trusted
business
news
source©2020
Bloomberg
Retirement
planning
change
ways
seen
since
Pension
Protection
2006
longawaited
Securing
Every
Community
Retirement
Enhancement
SECURE
passed
Congress
signed
President
Trump
part
trillion
spending
bill
happen
York
minute
talking
massive
gains
certain
healthcare
stocks
able
notch
feels
like
split
second
Unlike
names
areas
market
earnings
results
don’t
paint
full
picture
Rather
factors
like
clinical
trial
data
regulatory
decisions
useful
determining
particular
company
path
lifesustaining
revenues
Therefore
positive
update
catalyst
sends
shares
blasting
towards
outer
spaceThese
plays
however
aren’t
without
risk
disappointing
outcome
could
also
spark
ignites
flame
launching
shares
opposite
direction
This
makes
compelling
healthcare
stocks
difficult
spot
analysts
helpUsing
TipRanks’
database
found
three
healthcare
stocks
getting
love
Street
ahead
major
possible
catalysts
Each
name
amassed
enough
bullish
calls
earn
“Strong
Buy”
consensus
rating
Hefty
upside
potential
also
table
hereKala
Pharmaceuticals
KALADeveloping
treatments
inflammatory
ocular
conditions
Kala
Pharmaceuticals
wants
improve
lives
patients
everywhere
With
October
PDUFA
date
EYSUVIS
product
fastapproaching
several
analysts
think
time
boardEYSUVIS
corticosteroid
designed
shortterm
treatment
signs
symptoms
disease
multifactorial
disease
tears
ocular
surface
causes
discomfort
visual
disturbances
tear
film
instability
usually
accompanied
hyperosmolarity
higher
concentration
salt
water
tears
inflammation
Affecting
million
adults
condition
major
impact
patient’s
quality
life
cases
lead
declines
work
productivityWedbush
analyst
Liana
Moussatos
optimistic
therapy’s
prospects
noting
approval
could
come
PDUFA
date
launch
forecasted
early
2021
KALA
launch
ready
2020
analyst
believes
blockbuster
revenue
billion
could
storeCiting
presentations
Opinion
Leaders
KOLs
Moussatos
highlights
broad
market
opportunity
asset
given
current
unmet
need
potential
position
first
approved
corticosteroid
indicationAdditionally
based
clinical
data
unlike
already
approved
drugs
RESTASIS
CEQUA
XIIDRA
therapy
generated
rapid
onset
action
also
overcoming
wellknown
adverse
events
associated
ketosteroids
increases
intraocular
pressure
IOPMoussatos
mentioned
Holland
made
specific
reference
remarks
EYSUVIS’
rapid
onset
action
well
favorable
safety
profile
respect
elevation
reason
choice
firstline
therapy
high
percentage
patients
approved”Summing
analyst
stated
“Given
inadequate
control
flares
current
standardofcare
treatments
unwillingness
care
professionals
except
cornea
specialists
corticosteroids
offlabel
feel
EYSUVIS
uniquely
positioned
immediately
address
underserved
portion
market
using
corticosteroids
offlabel
shortterm
therapy
rapid
relief
gradually
addressing
chronic
users
immunomodulatory
agents
cyclosporine
RESTASIS
CEQUA
lifitegrast
XIIDRA
maintenance
therapy”To
Moussatos
rates
KALA
Outperform
along
price
target
This
puts
upside
potential
massive
watch
Moussatos’
track
record
click
hereIn
general
analysts
echo
Moussatos’
sentiment
Buys
Hold
Strong
consensus
rating
With
average
price
target
2080
upside
potential
comes
KALA
stock
analysis
TipRanksRevance
Therapeutics
RVNCFocused
innovative
aesthetic
therapeutic
offerings
Revance
Therapeutics
works
address
unmet
needs
patients
multiple
catalysts
horizon
Wall
Street
pounding
tableInvestors
eagerly
awaiting
decision
regarding
RVNC’s
novel
botulinum
toxin
BoNT
product
daxibotulinumtoxinA
Injection
DAXI
glabellar
frown
lines
PDUFA
date
scheduled
November
25Ahead
decision
Guggenheims
Seamus
Fernandez
high
hopes
“Given
positive
SAKURA
results
approval
expectations
high”
5star
analyst
commentedThat
said
Fernandez
argues
“DAXIs
potential
therapeutic
market
underappreciated
particularly
upcoming
ASPEN1
results
cervical
dystonia
movement
disorder
results
abnormal
posture
twisting
neck
This
indication
marks
DAXI’s
foray
world
therapeutics
pivotal
ASPEN1
topline
data
readout
come
lateNovember
When
comes
DAXI
indication
asset’s
longacting
profile
makes
standout
compared
available
BoNTs
shortacting
Phase
trial
DAXI
demonstrated
duration
effect
greater
2024
weeks
doses
versus
marketed
BoNT
toxins
weeks
average
ranges
1218
weeks
depending
formulation
dose“Payers
limited
BoNT
access
every12week
Q12W
dosing
schedule
However
based
expert
discussions
2025
novo
patients
complain
pain
recurring
prior
next
injection
thus
find
relief
existing
insurancemandated
Q12W
dosing
schedule
DAXI
could
alternative
BoNT
patients
Moreover
DAXI
demonstrated
peak
treatment
effect
earlier
Phase
trial
view
bestinclass”
Fernandez
explained
substantial
upside
could
cards
RVNC
reports
positive
dataIf
wasn’t
enough
release
topline
results
Phase
trial
plantar
fasciitis
common
cause
heel
pain
slated
timeframe
Roughly
million
patients
condition
seek
treatment
annually
standardofcare
usually
includes
NSAIDs
orthotics
physical
therapy
rest
weight
loss
corticosteroids
physicians
trying
avoid
excessive
steroidsHowever
BoNTs
used
offlabel
specialists
success
small
studies
succeed
randomized
Phase
Phase
study
“Given
opportunity
differentiate
existing
BoNT
therapeutic
market
RVNC
conducting
second
larger
Phase
trial
patients”
Fernandez
noted
While
models
don’t
include
favorable
results
could
game
changerTaking
consideration
Fernandez
maintains
rating
price
target
This
target
conveys
confidence
RVNC’s
ability
climb
higher
next
year
watch
Fernandez’s
track
record
click
hereAre
analysts
agreement
They
Only
ratings
exact
issued
last
three
months
Therefore
message
clear
RVNC
Strong
Given
3420
average
price
target
shares
could
surge
next
year
RVNC
stock
analysis
TipRanksRhythm
Pharmaceuticals
RYTMChanging
rare
genetic
disorders
obesity
diagnosed
treated
Rhythm
Pharmaceuticals
developing
cuttingedge
therapies
gears
potential
catalysts
Street
healthcare
nameBack
accepted
RYTMs
drug
application
setmelanotide
company’s
melanocortin4
receptor
MC4R
agonist
proopiomelanocortin
POMC
leptin
receptor
LEPR
deficiency
obesities
With
PDUFA
date
November
approval
decision
right
around
cornerLadenburg
analyst
Michael
Higgins
points
update
management
bullish
thesis
remains
much
intactRYTM
revealed
weekly
dosing
setmelanotide
achieved
similar
results
daily
formulation
comparable
weight
loss
among
treated
patients
exceeding
placebo
“This
data
could
label
expansion
setmelanotide
following
approval
particularly
advantageous
pediatric
administration
often
afflicted
POMC
LEPR”
Higgins
commentedThe
analyst
also
watching
data
pivotal
trial
evaluating
setmelanotide
BardetBiedl
Syndrome
Alström
syndrome
data
expected
2020
2021
Phase
Basket
Study
setmelanotide
highimpact
heterozygous
obesity
genetic
disorders
could
released
2020In
recent
journal
article
highlighting
setmelanotide
patients
published
data
highlights
success
patients
taking
setmelanotide
efficacy
measures
increase
prolonged
Higgins
sees
article
encouraging
given
written
several
reputable
KOLsHiggins
points
pivotal
patient
data
least
twice
size
POMCLEPR
Phase
trial
conveying
increase
size
market
opportunity
There
roughly
POMCLEPR
patients
compared
approximately
2000
BBSAlström
patients
basket
study
Higgins
estimates
tens
thousands
patients
pathway
disordersGiven
Higgins
stays
bulls
addition
rating
puts
price
target
stock
Investors
could
pocketing
gain
target
twelve
months
ahead
watch
Higgins’
track
record
click
hereJudging
consensus
breakdown
opinions
anything
mixed
With
Buys
Holds
Sells
assigned
last
three
months
word
Street
RYTM
Strong
3867
average
price
target
implies
upside
potential
RYTM
stock
analysis
TipRanksTo
find
good
ideas
healthcare
stocks
trading
attractive
valuations
visit
TipRanks’
Best
Stocks
newly
launched
tool
unites
TipRanks’
equity
insightsDisclaimer
opinions
expressed
article
solely
featured
analysts
content
intended
used
informational
purposes
important
analysis
making
investment
China
Tesla
rival
Xpeng
Motors
delivered
8578
electric
vehicles
year
earlier
Xpeng
stock
recent
jumped
Barron’s
took
Dividend
Aristocrats
sifted
find
companies
strong
balance
sheets
freecashflow
growth
2017
2019
freecashflow
yield
What’s
always
fashion
Wall
Street
Growth
Given
current
macro
environment
however
compelling
growth
stocks
become
even
harder
spot
That
said
despite
wild
ride
2020
select
names
could
still
shine
bright
reward
investors
handsomely
says
pros
Street
These
tickers
don’t
growth
prospects
serious
overachievers
Along
track
record
upward
movements
since
2020
kicked
solid
businesses
could
drive
share
prices
higher
2020
beyond
Bearing
mind
find
stocks
flagged
exciting
growth
plays
Wall
Street
Using
TipRanks’
database
locked
three
analystbacked
names
already
notched
impressive
gains
boast
strong
growth
narratives
longterm
Wixcom
Founded
online
development
platform
empowers
million
registered
users
develop
create
websites
yeartodate
several
members
Street
believe
name
plenty
fuel
left
tank
Writing
Securities
fivestar
analyst
Ronald
Josey
impressed
least
recent
quarter
company
added
million
registered
users
ever
quarter
driven
increased
marketing
spend
take
advantage
digital
shift
brought
COVID19
pandemic
What’s
Josey
cites
fact
July
subscriber
additions
accelerated
200plus
suggesting
trend
continuing
accelerate
However
argues
important
growth
indicator
cohort
future
collections
talks
elevated
growth
cadence
Wix’s
subscriber
additions
trends
continue
believe
bodes
well
2021
beyond
note
cohort
collections
yearoveryear”
Adding
good
news
number
customers
adopting
highervalue
products
Business
eCommerce
subscription
packages
trending
higher
Payment
transactions
nearly
doubled
quarteroverquarter
Josey
believes
speaks
adoption
Wix’s
eCommerce
products
highlighting
Wix’s
longerterm
opportunity
payments”
Josey
added
“With
accelerating
trends
around
adoption
Wix’s
core
products
like
Stores
recently
upgraded
Ascend
Payments
coupled
newer
product
offerings
like
Editor
guidance
incrementally
confident
Wix’s
ability
navigate
current
environment
potential
deliver
improving
Collections
growth
foreseeable
future”
Taking
consideration
Josey
maintains
Market
Outperform
rating
price
target
This
target
conveys
confidence
WIX’s
ability
climb
higher
next
year
watch
Josey’s
track
record
click
Where
analysts
stand
Buys
Hold
issued
last
three
months
Therefore
gets
Strong
consensus
rating
Given
33393
average
price
target
shares
could
surge
next
year
stock
analysis
TipRanks
Bilibili
BILI
Next
Bilibili
Chinese
video
sharing
website
based
Shanghai
centered
around
animation
comic
games
already
notched
gain
yeartodate
analysts
believe
growth
story
anything
Fivestar
analyst
Alex
Morgan
tells
clients
“incrementally
positive
BILIs
growth
outlook”
what’s
behind
bullish
thesis
noted
“Management’s
comment
peak
reaching
million
milestone
August
2020
makes
positive
BILIs
longterm
user
growth
beyond
GenZ
expect
user
growth
2020
supported
League
Legend
World
Championship
Season
SepOct
2020
BILI
broadcasting
platforms”
analyst
estimates
surpass
million
2023
BILI
strong
advertising
revenue
growth
second
quarter
yearoveryear
According
result
“demonstrates
strong
attraction
advertisers
driven
rich
content
growing
user
base”
analyst
expecting
solid
execution
user
expansion
revenue
diversification
increase
longterm
addressable
market
Going
forward
company
likely
continue
investing
branding
channel
marketing
support
user
growth
strong
seasonality
Expounding
implications
stated
“While
investment
could
expand
nearterm
financial
losses
believe
could
help
BILI
accelerate
user
expansion
support
monetization
growth
long
BILIs
revenue
drivers
game
subscription
directly
linked
user
growth”
result
analyst
sees
user
growth
major
potential
catalyst
launch
mobile
games
well
acceleration
content
provider
advertising
platform
Huahuo
helps
content
providers
connect
brand
advertisers
could
also
drive
significant
upside
Yao’s
opinion
line
optimistic
approach
stayed
bulls
Along
Overweight
rating
keeps
price
target
stock
Investors
could
pocketing
gain
target
twelve
months
ahead
watch
Yao’s
track
record
click
Turning
rest
Street
bulls
represent
majority
With
Buys
Holds
assigned
last
three
months
word
Street
BILI
Moderate
5343
average
price
target
implies
upside
potential
Bilibili
stock
analysis
TipRanks
MercadoLibre
MELI
Last
least
MercadoLibre
largest
eCommerce
companies
Latin
America
Given
rising
market
share
Wall
Street
thinks
name
could
even
gains
yeartodate
climb
After
hosting
meeting
members
MELI’s
management
team
Credit
Suisse’s
Stephen
even
confident
longterm
growth
prospects
noted
MELI
expanded
categorytake
rates
Chile
Mexico
2020
Brazil
Argentina
2H20
early
2021
points
resulting
take
rate
rationalization
could
drive
sellers
list
inventory
reduce
prices
With
increased
supply
argues
“MELI
seeing
cascading
benefits
improving
shopping
experience
rising
conversion
rates”
Additionally
previous
quarter
sequential
decrease
unit
shipping
costs
Flex
MELI
Logistics
integrates
micro
carriers
software
layer
also
improving
Weighing
commented
“Its
efforts
step
buildout
logistics
network
take
dependency
Correios
Brazil
yielding
tangible
results
also
places
company
potentially
underwrite
greater
amount
free
shipping
subsidies
unit
cost
deliveries
continues
decrease
taken
together
means
higher
reliability
faster
shipping
times
greater
cost
savings
passed
along
consumer”
Going
forward
MELI
expected
invest
Consumer
Electronics
categories
fill
selection
gaps
improve
price
competitiveness
According
expanded
logistics
footprint
could
enable
company
capitalize
opportunity
going
tackle
groceries
market
wasn’t
enough
despite
COVIDrelated
headwinds
MELI
sold
roughly
million
mobile
pointofsale
mPOS
devices
versus
900000
2020
driven
primarily
smaller
merchants
SMBs
economy
continues
reopen
device
also
ramp
Ju’s
opinion
analyst
added
“Also
million
Payers
Active
Buyers
Marketplace
cross
sellupsell
opportunity
beyond
existing
fintech
products
codes
MELIbranded
creditdebit
cards
consumer
credit
asset
managementFundo”
What’s
believes
increased
consumer
recognition
brand
advertising
particularly
Brazil
Mexico
could
help
fuel
momentum
Everything
MELI
going
convinced
reiterate
Outperform
rating
Along
call
attached
1484
price
target
suggesting
upside
potential
watch
Ju’s
track
record
click
general
analysts
echo
Ju’s
sentiment
Buys
Holds
Strong
consensus
rating
With
average
price
target
132273
upside
potential
comes
MercadoLibre
stock
analysis
TipRanks
Disclaimer
opinions
expressed
article
solely
featured
analysts
content
intended
used
informational
purposes
important
analysis
making
investment
2020
wild
ride
Inovio
Pharmaceuticals
Virtually
unknown
start
year
investors’
enthusiasm
coronavirus
stocks
seen
vaccine
specialist
post
yeartodate
gains
Naturally
INO4800
company’s
COVID19
vaccine
candidate
acted
main
catalystBut
program
come
duress
recently
series
setbacks
raised
questions
whether
Inovio
gets
vaccine
across
finish
lineFirst
dragged
feet
approval
originally
slated
JulyAugust
initiation
Phase
trial
situation
worse
last
month
regulatory
agency
temporary
halt
planned
trial
citing
need
information
INO4800
including
company’s
CELLECTRA
2000
delivery
device
gives
aheadINO
plans
submit
response
FDA’s
questions
month
agency
days
respond
goes
well
Inovio
kick
trial
November
earliest
companies
already
deep
Phase
trials
leave
small
player
much
catching
doSo
leave
investors
Piper
Sandler
analyst
Christopher
Raymond
advises
stay
sidelines
Proceedings
left
5star
analyst
“incrementally
cautious”
especially
given
lack
clarity
moving
forwardRaymond
said
“Details
press
release
sparse
management
quick
note
hold
trial
still
leaves
world
possible
reasons
especially
since
never
published
data
trial
Specifically
like
know
questions
relate
CELLECTRA
device
trial
design
something
else
Combining
miscues
insignificant
fact
still
calls
need
external
funding
start
program
continue
view
opportunity
skeptical
eye”Accordingly
Raymond
Neutral
Hold
rating
alongside
price
target
rating
might
well
said
Sell
figure
implies
drop
current
levels
watch
Raymond’s
track
record
click
hereRating
wise
Raymond’s
colleagues
take
similar
view
analyst
consensus
rates
stock
Hold
based
Buys
Holds
Sell
share
price
heading
however
Street
analysts
confident
1371
average
price
target
suggests
upside
next
months
Inovio
stock
analysis
TipRanksTo
find
good
ideas
stocks
trading
attractive
valuations
visit
TipRanks’
Best
Stocks
newly
launched
tool
unites
TipRanks’
equity
insightsDisclaimer
opinions
expressed
article
solely
featured
analysts
content
intended
used
informational
purposes
important
analysis
making
investment
Apple
stock
risen
since
beginning
year
spite
supply
constraints
pandemicrelated
production
delays
company
continues
enjoy
impressive
results
products
services
segments
Meanwhile
Seattlebased
Amazon
companies
planet
directly
benefit
pandemic
online
shopping
exploding
importance
cloud
computing
expanding
result
AMZN
stock
risen
year
date
choose
excellent
companies
invest
Amazon
stock
Apple
stock
would
conventional
wisdom
would
stock
share
value
falling
revenues
earnings
would
great
buying
proposition
conventional
wisdom
also
said
nothing
would
replace
horse
transportation
Hillary
Clinton
would
President
Sometimes
pays
look
hood
what’s
really
driving
events
stock
potentialsAnd
several
Wall
Street
analysts
done
three
recent
reports
analysts
highlighted
stocks
show
combination
features
Strong
consensus
view
high
upside
potential
high
dividend
yield
strongly
depressed
share
price
analysts
point
share
price
weakness
opportunity
investorsWe
tickers
TipRanks
database
find
made
stocks
compellingConocoPhillips
COPFirst
list
ConocoPhillips
world’s
largest
production
company
billion
annual
revenues
billion
annual
income
market
exceeding
billion
ConocoPhillips
based
Houston
Texas
operation
countries
Just
half
company’s
2019
production
came
USWith
strength
behind
shares
yeartodate
prices
depressing
earnings
second
quarter
company
recorded
loss
share
cents
loss
comes
heels
declines
prices
COP’s
crude
realized
average
price
2510
barrel
yearoveryear
natural
liquids
brought
barrel
equivalent
decline
line
revenues
fell
billionDespite
falling
revenues
earnings
kept
dividend
payment
company
raised
payment
cents
cents
last
autumn
recent
quarterly
payment
sent
early
September
marked
four
quarters
level
years
dividend
reliability
common
share
annually
dividend
yields
508JPMorgan
analyst
Phil
Gresh
notes
ConocoPhillips’
solid
balance
sheet
free
cash
flow
points
company’s
logical
path
forward“COP
announced
intention
back
stock
cash
hand
think
acknowledgement
management
views
stock
oversold
even
considering
commodity
price
environment
tend
agree
view
continues
plenty
cash
shortterm
investments
hand
opportunistic
capital
allocation”
Gresh
opinedAccordingly
Gresh
rates
Overweight
price
target
implies
upside
watch
Gresh’s
track
record
click
hereOverall
Strong
consensus
rating
shares
based
reviews
including
Buys
Holds
stock
sells
3390
average
price
target
4808
line
Gresh’s
stock
analysis
TipRanksBaker
Hughes
Company
BKRNext
Baker
Hughes
field
support
services
company
These
companies
supply
tech
needed
make
well
work
exploration
companies
rights
bring
heavy
equipment
it’s
support
service
providers
send
roughneck
drillers
tools
complete
wells
keep
operation
Baker
Hughes
offers
technical
services
segments
industry
upstream
midstream
downstreamProviding
essential
services
products
protected
Baker
Hughes
prevailing
prices
shares
underperformed
yeartodate
company’s
earnings
revenue
fell
sequentially
second
quarter
turning
negative
5cent
loss
share
Revenue
fell
billion
quarterLike
Baker
Hughes
made
point
maintaining
dividend
company’s
dividend
reliable
past
year
enviable
record
management
prioritized
reputation
payment
cents
common
share
quarterly
annualizes
cents
gives
robust
yield
56Writing
analyst
Kurt
Hallead
sees
Baker
Hughes
start
path
forward“BKRs
strategy
shed
services
skin
transition
global
Energy
Technology
company
many
industries
aggressively
pursue
carbon
reduction
targets
increase
spend
renewable
energy
BKRs
plan
lever
technology
portfolio
position
core
businesses
frontiers
notably
carbon
capture
hydrogen
energy
storage”
Hallead
noted
opinion
pivoting
Energy
Technology
Services
maintaining
relevancy
investors
ensuring
longterm
viability
customers
outperforming
peers
BKRs
strong
balance
sheet
generation
provide
firm
foundation
Energy
Technology
Services
company
Global
Best
Ideas
list
Global
Energy
Best
Ideas
list
Hallead
concludedHallead
optimistic
company’s
ability
effect
transition
shown
price
target
suggesting
upside
watch
Hallead’s
track
record
click
hereOverall
Wall
Street
agrees
Hallead
reviews
Buys
Holds
making
consensus
rating
Strong
average
price
target
2027
implying
upside
trading
price
1286
stock
analysis
TipRanksEnerplus
ERFLast
list
Enerplus
another
exploration
production
company
North
America’s
market
Enerplus
operates
Marcellus
shale
Pennsylvania
producing
natural
Williston
Basin
North
Dakota
Montana
producing
light
several
assets
Western
Canada
company
estimates
2020
average
production
89000
barrels
equivalent
back
smallcap
million
energy
player
seen
stock
fall
yearA
drop
topline
revenue
earnings
falling
loss
cents
share
haven’t
helped
real
culprit
companies
current
price
regime
COVID19
pandemic
energy
producers
several
directions
reduced
demand
economic
activity
declined
disruptions
production
workers
placed
stayhome
orders
disruptions
trade
networks
reasonsAnd
Enerplus
consistently
paid
monthly
dividend
payment
small
cent
Canadian
currency
slightly
less
cent
money
stock’s
share
price
well
result
cent
annualized
dividend
payment
gives
fairly
robust
yield
48Analyst
Greg
Pardy
watches
North
American
industry
especially
Canadian
segments
carefully
believes
Enerplus
sits
strong
position
weather
tough
market
“Enerplus
remains
favorite
intermediate
producer
given
consistent
operational
performance
bestinclass
balance
sheet…
Liquidity
wise
Enerplus
excellent
shape…
essentially
undrawn
US600
million
bank
credit
facility
Following
repayments
June
Enerplus
debt
maturities
2020”
analyst
cheered
line
optimistic
assessment
Pardy
gives
C500
US376
price
target
indicating
upside
coming
year
watch
Pardy’s
track
record
click
hereAll
split
Hold
Enerplus’
recent
reviews
support
Strong
analyst
consensus
share
price
US372
average
price
target
suggests
room
growth
year
ahead
stock
analysis
TipRanksTo
find
good
ideas
dividend
stocks
trading
attractive
valuations
visit
TipRanks’
Best
Stocks
newly
launched
tool
unites
TipRanks’
equity
insightsDisclaimer
opinions
expressed
article
solely
featured
analysts
content
intended
used
informational
purposes
important
analysis
making
investment
President
Trump
vowed
continue
lowering
taxes
defeats
Democratic
challenger
Biden
After
Mondays
close
Ford
Motor
Company
NYSE
reported
ownership
stake
Velodyne
Lidar
NASDAQ
VLDR
Ford
owns
13065444
shares
newly
public
companyVelodyne
Lidar
recently
merged
SPAC
Graf
Industrial
Corp
NYSE
GRAFWhat
Know
Ford
became
partial
owner
Velodyne
Lidar
back
2016
alongside
Baidu
NASDAQ
BIDU
together
invested
million
company
Baidu
issued
writingThe
filing
shows
Ford
sell
shares
added
position
Ford
subject
lockup
free
sell
shares
Velodyne
became
publiclytraded
companyWhy
Important
Fords
Farley
made
electric
vehicles
autonomous
vehicles
huge
priority
company
going
forward
vowed
Turn
around
automotive
operations
allocate
capital
Fords
strongest
franchises
highgrowth
opportunities
produce
compelling
uniquely
Ford
electric
vehicles
scale
stand
AVenabled
businessesFord
partner
Velodyne
developing
fully
autonomous
rideshare
taxis
Plans
called
cars
market
2021
since
delayed
2021Mizuho
analyst
Vijay
Rakesh
recently
sized
lidar
market
highlighted
stocks
sector
Rakesh
sees
global
lidar
market
going
billion
2019
billion
2025Whats
Next
Velodyne
Lidar
report
thirdquarter
earnings
5The
company
announced
September
million
deals
2024
increase
million
since
merger
Graf
announced
company
estimating
revenue
million
fiscal
2020Shares
Velodyne
1695
afterhours
trading
MondaySee
Benzinga
Options
Trades
This
Crazy
Market
Benzinga
Options
Follow
HighConviction
Trade
Ideas
Ford
Farley
Puts
Emphasis
EBIT
Margins
North
American
Sales
Show
Signs
Recovery
2020
Benzingacom
Benzinga
provide
investment
advice
rights
reserved
example
yeartodate
losses
financial
energy
sectors
respectively
Here
seven
stocks
dropped
2020
market
billion
perhaps
appropriate
topping
list
stocks
dropped
2020
natural
producer
Occidental
Petroleum
hails
worstperforming
sector
market
shares
premarket
trading
Monday
KeyBanc
Capital
Markets
analyst
Brandon
Nispel
downgraded
stock
underweight
sector
weight
sees
signs
deterioration
ATTs
DirecTV
business
August
also
sees
indications
companys
wireless
postpaid
average
revenue
user
falling
monthovermonth
basis
Nispel
previously
expected
DirecTVs
subscriber
losses
improve
projects
worse
third
quarter
More
broadly
secularly
competitively
challenged
20202021
expectations
high
across
segments
wrote
note
clients
Nispel
argued
positive
catalysts
outside
asset
sales
companys
roughly
dividend
yield
makes
value
trap
shares
declined
year
added
Graphicschip
maker
Nvidia
Monday
made
slew
announcements
related
work
artificial
intelligence
data
centers
announcements
drove
Nvidia
stock
sharply
higher
Morgan
Stanley
analyst
Stan
Slotsky
Monday
raised
rating
digitalsignature
firm
DocuSign
Overweight
Equal
Weight